# Критерии:
# Чистый код.
# Проходной балл 60.
# Должен быть представлен образец кода.
# Если есть теория, но нет примера кода, то баллы ниже.
# !! Правила экзамена, не обманывайте, не оглядывайтесь!
# !! Ответьте на вопросы и предоставьте образец кода.

Вопросы
1-й вопрос: Как можно отправить фотографию пользователю, используя библиотеку pytelegrambotapi?

#Ответ:

Пример кода:

2-й вопрос: Какие параметры можно указать при отправке изображения через метод send_photo?

#Ответ:

Пример кода:

3-й вопрос: Как принимать и обрабатывать фотографии, отправленные пользователем?

#Ответ:

Пример кода:

4-й вопрос: Что такое register_next_step_handler в pytelegrambotapi и для чего он используется?

#Ответ:

Пример кода:

5-й вопрос: Как с помощью register_next_step_handler связать несколько этапов обработки сообщений?

#Ответ:

Пример кода:

6-й вопрос: Как создать пользовательскую клавиатуру с помощью ReplyKeyboardMarkup?

#Ответ:

Пример кода:

7-й вопрос: Как создавать кнопки для клавиатуры с помощью KeyboardButton?

#Ответ:

Пример кода:

8-й вопрос: Что такое команды в контексте телеграм-ботов?

#Ответ:

Пример кода:

9-й вопрос: Как добавить команды боту с помощью pytelegrambotapi?

#Ответ:

Пример кода:

10-й вопрос: Как реализовать функцию обработки команд?

#Ответ:

Пример кода:

11-й вопрос: Какие типы контента (сообщений), помимо текста и фотографий, поддерживаются в pytelegrambotapi?

#Ответ:

Пример кода:

12-й вопрос: Как отправить аудиофайл пользователю с помощью метода send_audio в pytelegrambotapi?

#Ответ:

Пример кода:

13-й вопрос: Как подключиться к Telegram API с помощью библиотеки pytelegrambotapi?

#Ответ:

Пример кода:

14-й вопрос: Как я могу отправить стикер пользователю с помощью pytelegrambotapi?

#Ответ:

Пример кода:

15-й вопрос: Как создать бота в Telegram и получить токен для работы с ботом через pytelegrambotapi?

#Ответ:

Пример кода: